app/Controllers/Main/ClubsController.php

    public function index()
    {
        $model = model(ClubModel::class);

        $data = [
            'clubs' => $model->findAll(),
            'title' => 'Clubs',
        ];
---
SELECT *
FROM `nsca_clubs`