app/Controllers/Main/CommitteesController.php

    public function index()
    {
        $model = model(CommitteeModel::class);

        $data = [
            'committees' => $model->findAll(),
            'title'      => 'Committees',
        ];
---
SELECT *
FROM `nsca_committees`