app/Controllers/Main/TeamsController.php

SELECT *
FROM `nsca_teams`
---
    public function index()
    {
        $model = model(TeamModel::class);

        $data = [
            'teams' => $model->findAll(),
            'title' => 'Teams',
        ];